Ruby

brew "bat"
brew "btop"
brew "chezmoi"
brew "cmake"
brew "difftastic"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fzf"
brew "git"
brew "git-delta"
brew "jq"
brew "lazygit"
brew "llvm"
brew "neovim"
brew "ninja"
brew "node"
brew "pixi"
brew "pnpm"
brew "ripgrep"
brew "ruff"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "uv"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
