Ruby

brew "bat"
brew "btop"
brew "chezmoi"
brew "cloudflare-speed-cli"
brew "cmake"
brew "difftastic"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "herdr"
brew "hyperfine"
brew "jj"
brew "jq"
brew "just"
brew "lazygit"
brew "llvm"
brew "neovim"
brew "ninja"
brew "node"
brew "pixi"
brew "pnpm"
brew "prek"
brew "qsv"
brew "ripgrep"
brew "ruff"
brew "starship"
brew "tealdeer"
brew "the_silver_searcher"
brew "tokei"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "uv"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
